src/ut10_old/Reports/ОтчетПоПродавцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ОтчетПоПродавцам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Админ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/ut10_old/Reports/ОтчетПоПродавцам/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;
	ДатаНачО = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНач"));
	ДатаНачО.Использование = Истина;
	ДатаНачО.Значение = ДатаНач;
	    
	ДатаКонО = настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКон"));
	ДатаКонО.Использование = Истина;
	ДатаКонО.Значение = ДатаКон;
	
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Склад;
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = ЗначениеЗаполнено(Склад);
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ПравоеЗначение = Продавец;
	КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = ЗначениеЗаполнено(Продавец);
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[2].ПравоеЗначение = Админ;
	КомпоновщикНастроек.Настройки.Отбор.Элементы[2].Использование  = ЗначениеЗаполнено(Админ);

	
КонецПроцедуры
